In [1]:
#import libraries and api keys
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import csv
import os
import requests
import json

#from keys.gitignore import 
#from keys import

In [2]:
#load in csv files for each city
cle_file = "Zipcodes/Cleveland.csv"
cle_df = pd.read_csv(cle_file)
cle_df["zip_code"] = cle_df["zip_code"].astype(str)
cle_df.head()

  zip_code  distance          city state
0    44286    19.907     Richfield    OH
1    44233    18.982      Hinckley    OH
2    44141    15.561   Brecksville    OH
3    44136    15.988  Strongsville    OH
4    44087    18.933     Twinsburg    OH

In [3]:
#https://www.udsmapper.org/zcta-crosswalk.cfm
#load in csv for ZTAC info
zip_file = "Zipcodes/zip_to_zcta_2018.csv"
zip_df = pd.read_csv(zip_file)
zip_df.head()

   zip_code   zcta
0       501  11742
1       544  11742
2       601    601
3       602    602
4       603    603

In [4]:
#convert zip code to string to add back zeroes
zip_df["zip_code"] = zip_df["zip_code"].astype(str)

for index, row in zip_df.iterrows():
    
    length = len(zip_df.at[index, "zip_code"])
    ZIP = zip_df.at[index, "zip_code"]
    
    if (5 - length) == 2:
        new_zip = "00" + ZIP
        zip_df.at[index, "zip_code"] = new_zip
    else:
        if (5 - length) == 1:
            new_zip = "0" + ZIP
            zip_df.at[index, "zip_code"] = new_zip

#convert zcta to string to add back zeroes
zip_df["zcta"] = zip_df["zcta"].astype(str)

for index, row in zip_df.iterrows():
    
    length = len(zip_df.at[index, "zcta"])
    ZCTA = zip_df.at[index, "zcta"]
    
    if (5 - length) == 2:
        new_zcta = "00" + ZCTA
        zip_df.at[index, "zcta"] = new_zcta
    else:
        if (5 - length) == 1:
            new_zcta = "0" + ZCTA
            zip_df.at[index, "zcta"] = new_zcta
            
zip_df.head()

  zip_code   zcta
0    00501  11742
1    00544  11742
2    00601  00601
3    00602  00602
4    00603  00603

In [5]:
#join ZCTA data to city df
cle_merge = pd.merge(cle_df, zip_df, on="zip_code")
cle_merge.head()

  zip_code  distance          city state   zcta
0    44286    19.907     Richfield    OH  44286
1    44233    18.982      Hinckley    OH  44233
2    44141    15.561   Brecksville    OH  44141
3    44136    15.988  Strongsville    OH  44136
4    44087    18.933     Twinsburg    OH  44087

In [6]:
age_file = "Zipcodes/DEC_10_SF1_QTP1_with_ann.csv"
age_df = pd.read_csv(age_file)

#convert zcta to string to add back zeroes
age_df["zcta"] = age_df["zcta"].astype(str)

for index, row in age_df.iterrows():
    
    length = len(age_df.at[index, "zcta"])
    ZCTA2 = age_df.at[index, "zcta"]
    
    if (5 - length) == 2:
        new_zcta2 = "00" + ZCTA2
        age_df.at[index, "zcta"] = new_zcta2
    else:
        if (5 - length) == 1:
            new_zcta2 = "0" + ZCTA2
            age_df.at[index, "zcta"] = new_zcta2

age_df.head()

    zcta  median age
0  00601        35.9
1  00602        37.5
2  00603        38.2
3  00606        36.2
4  00610        38.1

In [7]:
cle_final = pd.merge(cle_merge, age_df, on="zcta")
cle_final.head()

  zip_code  distance          city state   zcta  median age
0    44286    19.907     Richfield    OH  44286        47.4
1    44233    18.982      Hinckley    OH  44233        45.3
2    44141    15.561   Brecksville    OH  44141        47.3
3    44136    15.988  Strongsville    OH  44136        43.5
4    44087    18.933     Twinsburg    OH  44087        40.8